XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <condition id="component.button.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.component.gpio_adapter.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.component.gpio_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.driver.common, component.spi_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.spi_adapter, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.driver.common, component.spi_adapter, component.gpio_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.spi_adapter, component.gpio_adapter, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio_adapter"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.driver.common, component.flash_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.flash_adapter, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash_adapter"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.flash_adapter.condition_id">
      <require condition="allOf.driver.common, driver.flash, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.flash, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.gpio_adapter.condition_id">
      <require condition="allOf.driver.gpio, anyOf=driver.port, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gpio, anyOf=driver.port, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="anyOf.driver.port.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.port.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
    </condition>
    <condition id="component.i2c_adapter.condition_id">
      <require condition="allOf.driver.common, driver.i2c, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.i2c, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.driver.common, component.timer_manager, anyOf=component.gpio_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debugconsole_lite.condition_id">
      <require condition="allOf.driver.common, component.log, utility.debug_console_lite, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, utility.debug_console_lite, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.driver.common, component.log, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.log, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.lptmr_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lptmr, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lptmr, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpuart, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpuart, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_dma, device=K32L2B11A.internal_condition"/>
    </condition>
