XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <condition id="allOf.component.lpuart_adapter, component.timer_manager, anyOf=driver.lpuart_dma, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="anyOf.driver.lpuart_dma.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart_dma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_dma"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.driver.common, component.lists, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.common, driver.pit, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.pit, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.pwm_tpm_adapter.condition_id">
      <require condition="allOf.driver.common, driver.tpm, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.tpm, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="tpm"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.rtc.condition_id">
      <require condition="allOf.driver.common, driver.rtc, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.rtc, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtc"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_spi, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, component.lists, anyOf=component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_spi, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_spi.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_uart, component.serial_manager_virtual, component.serial_manager_spi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.component.serial_manager, anyOf=allOf=driver.spi, component.spi_adapter, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, anyOf=allOf=driver.spi, component.spi_adapter, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.allOf=driver.spi, component.spi_adapter.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=driver.spi, component.spi_adapter.internal_condition">
      <accept condition="allOf.driver.spi, component.spi_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.driver.spi, component.spi_adapter.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi_adapter"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, component.serial_manager, anyOf=driver.lpuart, driver.uart, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require condition="anyOf.driver.lpuart, driver.uart.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart, driver.uart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
