XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <condition id="allOf.driver.dma, driver.flexio_i2s, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_spi, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_spi, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.flexio_uart, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.flexio_uart, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=K32L2B11A.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.i2c_dma.condition_id">
      <require condition="allOf.driver.dma, driver.i2c, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.i2c, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.llwu.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.lpuart, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.lpuart, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rcm.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.sim.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.slcd.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.slcd_engine.condition_id">
      <require condition="anyOf.driver.slcd_lcd_s401m16kr.internal_condition"/>
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.slcd_lcd_s401m16kr.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr"/>
    </condition>
    <condition id="device.K32L2B21A.internal_condition">
      <accept Dname="K32L2B21VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B21VMP0A" Dvendor="NXP:11"/>
    </condition>
