XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <condition id="device.K32L2B31A.internal_condition">
      <accept Dname="K32L2B31VFM0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VFT0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VLH0A" Dvendor="NXP:11"/>
      <accept Dname="K32L2B31VMP0A" Dvendor="NXP:11"/>
    </condition>
    <condition id="driver.slcd_lcd_s401m16kr.condition_id">
      <require condition="allOf.board=frdmk32l2b, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.board=frdmk32l2b, device=K32L2B11A.internal_condition">
      <require condition="board.frdmk32l2b.internal_condition"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="board.frdmk32l2b.internal_condition">
      <accept condition="device.K32L2B11A.internal_condition"/>
      <accept condition="device.K32L2B21A.internal_condition"/>
      <accept condition="device.K32L2B31A.internal_condition"/>
    </condition>
    <condition id="driver.smc.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.spi.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.spi_dma.condition_id">
      <require condition="allOf.driver.dma, driver.spi, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.spi, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.tpm.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="driver.uart.condition_id">
      <require condition="allOf.driver.common, device_id=K32L2B11xxxxA.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=K32L2B11xxxxA.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.K32L2B11xxxxA.internal_condition"/>
    </condition>
    <condition id="driver.uart_dma.condition_id">
      <require condition="allOf.driver.dma, driver.uart, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dma, driver.uart, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="driver.vref.condition_id">
      <require condition="allOf.device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.assert.condition_id">
      <require condition="allOf.utility.debug_console, driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console, driver.common, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.utility.debug_console_lite, driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.debug_console_lite, driver.common, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.debug_console.condition_id">
      <require condition="allOf.component.serial_manager, driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.component.lpuart_adapter, device_id=K32L2B11xxxxA, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device_id=K32L2B11xxxxA, driver.common.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device_id.K32L2B11xxxxA.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="utility.notifier.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.shell.condition_id">
      <require condition="allOf.utility.str, component.lists, driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
    <condition id="allOf.utility.str, component.lists, driver.common, device=K32L2B11A.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.K32L2B11A.internal_condition"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=K32L2B11A.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="K32L2B11A" Cversion="1.0.0" condition="DEVICES_Project_Template.K32L2B11A.condition_id" isDefaultVariant="1">
      <description>Devices_project_template K32L2B11A</description>
      <files>
        <file category="header" attr="config" name="devices/K32L2B11A/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B11A/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B11A/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B11A/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B11A/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B11A/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/K32L2B11A/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/K32L2B11A/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/K32L2B11A/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="RTE_Device.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/K32L2B11A/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/K32L2B11A/template/"/>
      </files>
    </component>
