XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="K32L2B11A_linker" Cversion="1.0.0" condition="device.K32L2B11A_linker.condition_id">
      <description>Device K32L2B11A_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/arm/K32L2B11xxxxA_flash.scf" version="1.0.0" projectpath="K32L2B11A/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/arm/K32L2B11xxxxA_ram.scf" version="1.0.0" projectpath="K32L2B11A/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/gcc/K32L2B11xxxxA_flash.ld" version="1.0.0" projectpath="K32L2B11A/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/gcc/K32L2B11xxxxA_ram.ld" version="1.0.0" projectpath="K32L2B11A/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/iar/K32L2B11xxxxA_flash.icf" version="1.0.0" projectpath="K32L2B11A/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=K32L2B11xxxxA.condition_id" category="linkerScript" attr="config" name="devices/K32L2B11A/iar/K32L2B11xxxxA_ram.icf" version="1.0.0" projectpath="K32L2B11A/iar"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.1.0" condition="device.K32L2B11A_startup.condition_id">
      <description>Device K32L2B11A_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/K32L2B11A/iar/startup_K32L2B11A.s" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/K32L2B11A/gcc/startup_K32L2B11A.S" version="1.1.0" projectpath="startup"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/K32L2B11A/arm/startup_K32L2B11A.S" version="1.1.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="K32L2B11A_system" Cversion="1.0.0" condition="device.K32L2B11A_system.condition_id">
      <description>Device K32L2B11A_system</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/system_K32L2B11A.c" projectpath="device"/>
        <file category="header" name="devices/K32L2B11A/system_K32L2B11A.h" projectpath="device"/>
        <file category="include" name="devices/K32L2B11A/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.3.0" condition="driver.adc16.condition_id">
      <description>ADC16 Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_adc16.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_adc16.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cmp" Cversion="2.0.3" condition="driver.cmp.condition_id">
      <description>CMP Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_cmp.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_cmp.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_i2c.condition_id">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/cmsis_drivers/fsl_i2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/cmsis_drivers/fsl_i2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.5.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="spi_cmsis" Cversion="2.3.0" Capiversion="2.2.0" condition="driver.cmsis_spi.condition_id">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/cmsis_drivers/fsl_spi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/cmsis_drivers/fsl_spi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.1.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="driver.common.condition_id">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/K32L2B11A/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/K32L2B11A/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cop" Cversion="2.0.1" condition="driver.cop.condition_id">
      <description>COP Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_cop.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_cop.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
