XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.K32L2B11A_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc" Cversion="2.3.0" condition="driver.rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sim" Cversion="2.1.3" condition="driver.sim.condition_id">
      <description>SIM Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_sim.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_sim.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd" Cversion="2.0.4" condition="driver.slcd.condition_id">
      <description>SLCD Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_slcd.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_slcd.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_engine" Cversion="1.0.2" condition="driver.slcd_engine.condition_id">
      <description>Driver slcd_engine</description>
      <files>
        <file category="sourceC" name="components/slcd_engine/slcd_engine.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/slcd_engine.h" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/slcd_panel.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr" Cversion="1.0.2" condition="driver.slcd_lcd_s401m16kr.condition_id">
      <description>Driver slcd_lcd_s401m16kr</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_LCD_S401M16KR_H
#define SLCD_PANEL_LCD_S401M16KR_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/LCD-S401M16KR/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smc" Cversion="2.0.7" condition="driver.smc.condition_id">
      <description>SMC Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_smc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_smc.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.1.2" condition="driver.spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.1.2" condition="driver.spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tpm" Cversion="2.2.3" condition="driver.tpm.condition_id">
      <description>TPM Driver</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_tpm.c" projectpath="drivers"/>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_tpm.h" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart" Cversion="2.5.1" condition="driver.uart.condition_id">
      <description>UART Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_uart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_uart.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="uart_dma" Cversion="2.5.0" condition="driver.uart_dma.condition_id">
      <description>UART Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_uart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_uart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="vref" Cversion="2.1.2" condition="driver.vref.condition_id">
      <description>VREF Driver</description>
      <files>
        <file category="header" name="devices/K32L2B11A/drivers/fsl_vref.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/K32L2B11A/drivers/fsl_vref.c" projectpath="drivers"/>
        <file category="include" name="devices/K32L2B11A/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="baremetal" Cversion="1.0.0" condition="middleware.baremetal.condition_id">
      <description>Middleware baremetal</description>
      <RTE_Components_h>
#ifndef SDK_OS_BAREMETAL
#define SDK_OS_BAREMETAL 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="middleware/bm/readme.txt" projectpath="middleware/bm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="misc_utilities" Cversion="1.1.1" condition="utilities.misc_utilities.condition_id">
      <description>Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.</description>
      <files>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/K32L2B11A/utilities/fsl_sbrk.c" projectpath="utilities"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceC" name="devices/K32L2B11A/utilities/fsl_syscall_stub.c" projectpath="utilities"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert" Cversion="1.0.0" condition="utility.assert.condition_id">
      <description>Utility assert</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite" Cversion="1.0.0" condition="utility.assert_lite.condition_id">
      <description>Utility assert_lite</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/debug_console_lite/fsl_assert.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/debug_console_lite/fsl_assert.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console" Cversion="1.0.1" condition="utility.debug_console.condition_id">
      <description>Utility debug_console</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/K32L2B11A/utilities/debug_console/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/debug_console/fsl_debug_console.h" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/debug_console/fsl_debug_console_conf.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/str/"/>
        <file category="include" name="devices/K32L2B11A/utilities/debug_console/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite" Cversion="1.0.0" condition="utility.debug_console_lite.condition_id">
      <description>Utility debug_console_lite</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="sourceC" name="devices/K32L2B11A/utilities/debug_console_lite/fsl_debug_console.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/debug_console_lite/fsl_debug_console.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/str/"/>
        <file category="include" name="devices/K32L2B11A/utilities/debug_console_lite/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="notifier" Cversion="1.0.0" condition="utility.notifier.condition_id">
      <description>Utility notifier</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/fsl_notifier.c" projectpath="utilities/utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/fsl_notifier.h" projectpath="utilities/utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="shell" Cversion="1.0.0" condition="utility.shell.condition_id">
      <description>Utility shell</description>
      <RTE_Components_h>
#ifndef DEBUG_CONSOLE_RX_ENABLE
#define DEBUG_CONSOLE_RX_ENABLE 0
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/shell/fsl_shell.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/shell/fsl_shell.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/shell/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="str" Cversion="1.0.0" condition="utility.str.condition_id">
      <description>Utility str</description>
      <files>
        <file category="sourceC" name="devices/K32L2B11A/utilities/str/fsl_str.c" projectpath="utilities"/>
        <file category="header" name="devices/K32L2B11A/utilities/str/fsl_str.h" projectpath="utilities"/>
        <file category="include" name="devices/K32L2B11A/utilities/str/"/>
      </files>
    </component>
  </components>
</package>
